<template>
  <div class="about">
    <h1>Создать простое одностраничное веб-приложение о погоде</h1>
    <p>Данные можно взять с сайта openweathermap.org</p>
    <p>Приложение должно уметь:</p>
    <p>- Добавлять/удалять города</p>
    <p>- Сохранять локально данные</p>
    <p>- Автоматически запрашивать погоду по координатам пользователя — это город/место по умолчанию.</p>
    <p>Примечания:</p>
    <p>Особое внимание следует уделить скорости работы, зависание интерфейса при выполнении операций загрузки данных недопустимо;</p>
    <p>Фреймворки: VueJS;</p>
    <p>Пишите код так, как бы вы его писали в работе - внутренности задания будут оцениваться даже</p>
    <p>тщательней, чем внешнее соответствие заданию;</p>
    <p>Код должен быть организован так, чтобы его можно было заново использовать;</p>
    <p>Приложение должно быть адаптивным!</p>
    <p>Помните про обработку ошибок!</p>
  </div>
</template>
